## pi
`PI`<br/><br/>
**Description:** <br/>Returns the mathematical constant Ï€.<br/>

**Syntax:**<br/>

`pi`<br/>


**Example:**<br/>

```asrc
pi
```

**Result:**<br/>

```asrc
3.141592653589793
```

## E
`e`<br/><br/>
**Description:** <br/>Returns the mathematical constant e.<br/>

**Syntax:**<br/>

`e`<br/>


**Example:**<br/>

```asrc
e
```

**Result:**<br/>

```asrc
2.718281828459045
```

## sqrt2
`root2`<br/><br/>
**Description:** <br/>Returns the square root of 2.<br/>

**Syntax:**<br/>

`sqrt2`<br/>


**Example:**<br/>

```asrc
sqrt2
```

**Result:**<br/>

```asrc
1.4142135623730951
```

## ln2
**Description:** <br/>Returns the natural logarithm of 2.<br/>

**Syntax:**<br/>

`ln2`<br/>


**Example:**<br/>

```asrc
ln2
```

**Result:**<br/>

```asrc
0.6931471805599453
```

## ln10
**Description:** <br/>Returns the natural logarithm of 10.<br/>

**Syntax:**<br/>

`ln10`<br/>


**Example:**<br/>

```asrc
ln10
```

**Result:**<br/>

```asrc
2.302585092994046
```

## log2e
**Description:** <br/>Returns the base 2 logarithm of e.<br/>

**Syntax:**<br/>

`log2e`<br/>


**Example:**<br/>

```asrc
log2e
```

**Result:**<br/>

```asrc
1.4426950408889634
```

## log10e
**Description:** <br/>Returns the base 10 logarithm of e.<br/>

**Syntax:**<br/>

`log10e`<br/>


**Example:**<br/>

```asrc
log10e
```

**Result:**<br/>

```asrc
0.4342944819032518
```

